'''
Класс ассемблерных команд
'''


class Asm:

    SF = (1, 2, 4, 8, 16, 10)

    # Шаблоны
    # разбивка на группы бит 
    Template = {
        'A':(4, 8, 12, 16, 20),
        'B':(5, 20),
        'C':(5, 8, 12, 16, 20),
        'D':(5, 10, 20),
        'E':(5, 10, 12, 16, 20),
        'F':(5, 10, 15, 20),
        'G':(5, 10, 15, 20),
        'M':(5, 10, 19, 20),
        'H':(20,)
    } 
    
    Template2 = {
        }
    
    OpToAsm = (
    # Т=00       
        (('F', 'addi', 'r{reg1}, r{reg2}, r{reg3}'),  # 00:0000000000:{reg1}:{reg2}:{reg3}:00000 шаблон F 
        ('E', 'addi', 'r{reg1}, r{reg2}, {imm10}'),  # 00:0000000001:{reg1}:{reg2}:{imm10} шаблон E 
        ('F', 'subi', 'r{reg1}, r{reg2}, r{reg3}'),  # 00:0000000010:{reg1}:{reg2}:{reg3}:00000 шаблон F 
        ('E', 'subi', 'r{reg1}, r{reg2}, {imm10}'),  # 00:0000000011:{reg1}:{reg2}:{imm10} шаблон E 
        ('F', 'muliu', 'r{reg1}, r{reg2}, r{reg3}'),  # 00:0000000100:{reg1}:{reg2}:{reg3}:00000 шаблон F 
        ('E', 'muliu', 'r{reg1}, r{reg2}, {imm10}'),  # 00:0000000101:{reg1}:{reg2}:{imm10} шаблон E 
        ('F', 'mulis', 'r{reg1}, r{reg2}, r{reg3}'),  # 00:0000000110:{reg1}:{reg2}:{reg3}:00000 шаблон F 
        ('E', 'mulis', 'r{reg1}, r{reg2}, {imm10}'),  # 00:0000000111:{reg1}:{reg2}:{imm10} шаблон E 
        ('F', 'diviu', 'r{reg1}, r{reg2}, r{reg3}'),  # 00:0000001000:{reg1}:{reg2}:{reg3}:00000 шаблон F 
        ('E', 'diviu', 'r{reg1}, r{reg2}, {imm10}'),  # 00:0000001001:{reg1}:{reg2}:{imm10} шаблон E 
        ('F', 'divis', 'r{reg1}, r{reg2}, r{reg3}'),  # 00:0000001010:{reg1}:{reg2}:{reg3}:00000 шаблон F 
        ('E', 'divis', 'r{reg1}, r{reg2}, {imm10}'),  # 00:0000001011:{reg1}:{reg2}:{imm10} шаблон E 
        ('F', 'modiu', 'r{reg1}, r{reg2}, r{reg3}'),  # 00:0000001100:{reg1}:{reg2}:{reg3}:00000 шаблон F 
        ('E', 'modiu', 'r{reg1}, r{reg2}, {imm10}'),  # 00:0000001101:{reg1}:{reg2}:{imm10} шаблон E 
        ('F', 'modis', 'r{reg1}, r{reg2}, r{reg3}'),  # 00:0000001110:{reg1}:{reg2}:{reg3}:00000 шаблон F 
        ('E', 'modis', 'r{reg1}, r{reg2}, {imm10}'),  # 00:0000001111:{reg1}:{reg2}:{imm10} шаблон E 
        ('G', 'divmodiu', 'r{reg1}, r{reg2}, r{reg3}, r{reg4}'),  # 00:0000010000:{reg1}:{reg2}:{reg3}:{reg4} шаблон G 
        ('G', 'divmodis', 'r{reg1}, r{reg2}, r{reg3}, r{reg4}'),  # 00:0000010001:{reg1}:{reg2}:{reg3}:{reg4} шаблон G 
        ('F', 'cmpiu', 'r{reg1}, r{reg2}, r{reg3}'),  # 00:0000010010:{reg1}:{reg2}:{reg3}:00000 шаблон F 
        ('E', 'cmpiu', 'r{reg1}, r{reg2}, {imm10}'),  # 00:0000010011:{reg1}:{reg2}:{imm10} шаблон E 
        ('F', 'cmpis', 'r{reg1}, r{reg2}, r{reg3}'),  # 00:0000010100:{reg1}:{reg2}:{reg3}:00000 шаблон F 
        ('E', 'cmpis', 'r{reg1}, r{reg2}, {imm10}'),  # 00:0000010101:{reg1}:{reg2}:{imm10} шаблон E 
        ('F', 'and', 'r{reg1}, r{reg2},r{reg3}'),  # 00:0000010110:{reg1}:{reg2}:{reg3}:00000 шаблон F
        ('E', 'and', 'r{reg1}, r{reg2}, {imm10}'),  # 00:0000010111:{reg1}:{reg2}:{imm10} шаблон E
        ('F', 'or', 'r{reg1}, r{reg2}, r{reg3}'),  # 00:0000011000:{reg1}:{reg2}:{reg3}:00000 шаблон F
        ('E', 'or', 'r{reg1}, r{reg2}, {imm10}'),  # 00:0000011001:{reg1}:{reg2}:{imm10} шаблон E
        ('F', 'xor', 'r{reg1}, r{reg2}, r{reg3}'),  # 00:0000011010:{reg1}:{reg2}:{reg3}:00000 шаблон F
        ('E', 'xor', 'r{reg1}, r{reg2}, {imm10}'),  # 00:0000011011:{reg1}:{reg2}:{imm10} шаблон E
        ('F', 'andn', 'r{reg1}, r{reg2}, r{reg3}'),  # 00:0000011100:{reg1}:{reg2}:{reg3}:00000 шаблон F
        ('E', 'andn', 'r{reg1}, r{reg2}, {imm10}'),  # 00:0000011101:{reg1}:{reg2}:{imm10} шаблон E
        ('F', 'orn', 'r{reg1}, r{reg2}, r{reg3}'),  # 00:0000011110:{reg1}:{reg2}:{reg3}:00000 шаблон F
        ('E', 'orn', 'r{reg1}, r{reg2}, {imm10}'),  #  00:0000011111:{reg1}:{reg2}:{imm10} шаблон E
        ('F', 'xorn', 'r{reg1}, r{reg2}, r{reg3}'),  #  00:0000100000:{reg1}:{reg2}:{reg3}:00000 шаблон F
        ('E', 'xorn', 'r{reg1}, r{reg2}, {imm10}'),  # 00:0000100001:{reg1}:{reg2}:{imm10} шаблон E
        ('E', 'lshift', 'r{reg1}, r{reg2}, r{reg3}'),  # 00:0000100010:{reg1}:{reg2}:{reg3}:00000 шаблон F
        ('E', 'lshift', 'r{reg1}, r{reg2}, {imm10}'),  # 00:0000100011:{reg1}:{reg2}:{imm10} шаблон E
        ('E', 'rshift', 'r{reg1}, r{reg2}, r{reg3}'),  # 00:0000100100:{reg1}:{reg2}:{reg3}:00000 шаблон F
        ('E', 'rshift', 'r{reg1}, r{reg2}, {imm10}'),  # 00:0000100101:{reg1}:{reg2}:{imm10} шаблон E
        ('E', 'rshifts', 'r{reg1}, r{reg2}, r{reg3}'),  # 00:0000100110:{reg1}:{reg2}:{reg3}:00000 шаблон F
        ('E', 'rshifts', 'r{reg1}, r{reg2}, {imm10}'),  # 00:0000100111:{reg1}:{reg2}:{imm10} шаблон E
        ('D', 'not', 'r{reg1}, r{reg2}'),  # 00:0000101000:{reg1}:{reg2}:0000000000 шаблон D
        ('C', 'not', 'r{reg}, {imm15}')),  # 00:0000101001:{reg}:imm15  шаблон C
    # Т=01       
        (('F', 'addf', 'f{reg1}, f{reg2}, f{reg3}'),  # 01:0000000000:{reg1}:{reg2}:{reg3}:00000 шаблон F
        ('F', 'subf', 'f{reg1}, f{reg2}, f{reg3}'),  # 01:0000000001:{reg1}:{reg2}:{reg3}:00000 шаблон F
        ('F', 'mulf', 'f{reg1}, f{reg2}, f{reg3}'),  # 01:0000000010:{reg1}:{reg2}:{reg3}:00000 шаблон F
        ('F', 'divf', 'f{reg1}, f{reg2}, f{reg3}'),  # 01:0000000011:{reg1}:{reg2}:{reg3}:00000 шаблон F
        ('F', 'cmpf', 'r{reg1}, f{reg2}, f{reg3}'),  # 01:0000000100:{reg1}:{reg2}:{reg3}:00000 шаблон F
        ('F', 'roundn', 'r{reg1}, f{reg2}'),  # 01:0000000101:{reg1}:{reg2}:0000000000 шаблон D
        ('F', 'roundl', 'r{reg1}, f{reg2}'),  # 01:0000000110:{reg1}:{reg2}:0000000000 шаблон D
        ('F', 'roundg', 'r{reg1}, f{reg2}'),  # 01:0000000111:{reg1}:{reg2}:0000000000 шаблон D
        ('F', 'roundt', 'r{reg1}, f{reg2}'),  # 01:0000001000:{reg1}:{reg2}:0000000000 шаблон D
        ('F', 'frac', 'f{reg1}, f{reg2}'),  # 01:0000001001:{reg1}:{reg2}:0000000000 шаблон D
        ('F', 'absf', 'f{reg1}, f{reg2}'),  # 01:0000001010:{reg1}:{reg2}:0000000000 шаблон D
        ('F', 'mul2f', 'f{reg1}, f{reg2}, r{reg3}'),  # 01:0000001011:{reg1}:{reg2}:{reg3}:00000 шаблон F
        ('F', 'mul2f', 'f{reg1}, f{reg2}, {imm10}', 'z'),  # 01:0000001011:{reg1}:{reg2}:{imm10}:00000 шаблон E
        ('F', 'chsf', 'f{reg1}, f{reg2}')),  # 01:0000000101:{reg1}:{reg2}:0000000000 шаблон D
    # Т=10       
        (('B', 'jmp', 'r{reg}'),  # 10:0000000000:{reg}:000000000000000 шаблон B
        ('D', 'jmps', 'r{reg1}, r{reg2}'),  # 10:0000000001:{reg1}:{reg2}:0000000000 шаблон D
        ('D', 'jmpz', 'r{reg1}, r{reg2}'),  # 10:0000000010:{reg1}:{reg2}:0000000000 шаблон D
        ('D', 'jmpp', 'r{reg1}, r{reg2}'),  # 10:0000000011:{reg1}:{reg2}:0000000000 шаблон D
        ('D', 'jmpnz', 'r{reg1}, r{reg2}'),  # 10:0000000100:{reg1}:{reg2}:0000000000 шаблон D
        ('D', 'jmpge', 'r{reg1}, r{reg2}'),  # 10:0000000101:{reg1}:{reg2}:0000000000 шаблон D
        ('D', 'jmple', 'r{reg1}, r{reg2}'),  # 10:0000000110:{reg1}:{reg2}:0000000000 шаблон D
        ('B', 'jmpr', 'r{reg1}'),  # 10:0000000111:{reg}:000000000000000 шаблон B
        ('D', 'jmpsr', 'r{reg1}, r{reg2}'),  # 10:0000001000:{reg1}:{reg2}:0000000000 шаблон D
        ('D', 'jmpzr', 'r{reg1}, r{reg2}'),  # 10:0000001001:{reg1}:{reg2}:0000000000 шаблон D
        ('D', 'jmppr', 'r{reg1}, r{reg2}'),  # 10:0000001010:{reg1}:{reg2}:0000000000 шаблон D
        ('D', 'jmpnzr', 'r{reg1}, r{reg2}'),  # 10:0000001011:{reg1}:{reg2}:0000000000 шаблон D
        ('D', 'jmpger', 'r{reg1}, r{reg2}'),  # 10:0000001100:{reg1}:{reg2}:0000000000 шаблон D
        ('D', 'jmpler', 'r{reg1}, r{reg2}'),  # 10:0000001101:{reg1}:{reg2}:0000000000 шаблон D
        ('A', 'jmpr', '{imm20}'),  # 10:0000001110:{imm20} шаблон A
        ('C', 'jmpsr', 'r{reg}, {imm15}'),  # 10:0000001111:{reg}:{imm15}  шаблон C
        ('C', 'jmpzr', 'r{reg}, {imm15}'),  # 10:0000010000:{reg}:{imm15}  шаблон C
        ('C', 'jmppr', 'r{reg}, {imm15}'),  # 10:0000010001:{reg}:{imm15}  шаблон C
        ('C', 'jmpnzr', 'r{reg}, {imm15}'),  # 10:0000010010:{reg}:{imm15}  шаблон C
        ('C', 'jmpger', 'r{reg}, {imm15}'),  # 10:0000010011:{reg}:{imm15}  шаблон C
        ('C', 'jmpler', 'r{reg}, {imm15}'),  # 10:0000010100:{reg}:{imm15}  шаблон C
        ('B', 'call', 'r{reg}'),  # 10:0000010101:{reg}:000000000000000 шаблон B
        ('D', 'calls', 'r{reg1}, r{reg2}'),  # 10:0000010110:{reg1}:{reg2}:0000000000 шаблон D
        ('D', 'callz', 'r{reg1}, r{reg2}'),  # 10:0000010111:{reg1}:{reg2}:0000000000 шаблон D
        ('D', 'callp', 'r{reg1}, r{reg2}'),  # 10:0000011000:{reg1}:{reg2}:0000000000 шаблон D
        ('D', 'callnz', 'r{reg1}, r{reg2}'),  # 10:0000011001:{reg1}:{reg2}:0000000000 шаблон D
        ('D', 'callge', 'r{reg1}, r{reg2}'),  # 10:0000011010:{reg1}:{reg2}:0000000000 шаблон D
        ('D', 'callle', 'r{reg1}, r{reg2}'),  # 10:0000011011:{reg1}:{reg2}:0000000000 шаблон D
        ('B', 'callr', 'r{reg1}'),  # 10:0000011100:{reg}:000000000000000 шаблон B
        ('D', 'callsr', 'r{reg1}, r{reg2}'),  # 10:0000011101:{reg1}:{reg2}:0000000000 шаблон D
        ('D', 'callzr', 'r{reg1}, r{reg2}'),  # 10:0000011110:{reg1}:{reg2}:0000000000 шаблон D
        ('D', 'callpr', 'r{reg1}, r{reg2}'),  # 10:0000011111:{reg1}:{reg2}:0000000000 шаблон D
        ('D', 'callnzr', 'r{reg1}, r{reg2}'),  # 10:0000100000:{reg1}:{reg2}:0000000000 шаблон D
        ('D', 'callger', 'r{reg1}, r{reg2}'),  # 10:0000100001:{reg1}:{reg2}:0000000000 шаблон D
        ('D', 'calller', 'r{reg1}, r{reg2}'),  # 10:0000100010:{reg1}:{reg2}:0000000000 шаблон D
        ('A', 'callr', '{imm20}'),  # 10:0000100011:{imm20} шаблон A
        ('C', 'callsr', 'r{reg}, {imm15}'),  # 10:0000100100:{reg}:{imm15}  шаблон C
        ('C', 'callzr', 'r{reg}, {imm15}'),  # 10:0000100101:{reg}:{imm15}  шаблон C
        ('C', 'callpr', 'r{reg}, {imm15}'),  # 10:0000100110:{reg}:{imm15}  шаблон C
        ('C', 'callnzr', 'r{reg}, {imm15}'),  # 10:0000100111:{reg}:{imm15}  шаблон C
        ('C', 'callger', 'r{reg}, {imm15}'),  # 10:0000101000:{reg}:{imm15}  шаблон C
        ('C', 'calller', 'r{reg}, {imm15}'),  # 10:0000101001:{reg}:imm15  шаблон C
        ('H', 'ret', ''),  # 10:0000101010:00000000000000000000 шаблон H
        ('B', 'rets', 'r{reg}'),  # 10:0000101011:{reg}:000000000000000 шаблон B
        ('B', 'retz', 'r{reg}'),  # 10:0000101100:{reg}:000000000000000 шаблон B
        ('B', 'retp', 'r{reg}'),  # 10:0000101101:{reg}:000000000000000 шаблон B
        ('B', 'retnz', 'r{reg}'),  # 10:0000101110:{reg}:000000000000000 шаблон B
        ('B', 'retge', 'r{reg}'),  # 10:0000101111:{reg}:000000000000000 шаблон B
        ('B', 'retle', 'r{reg}'),  # 10:0000110000:{reg}:000000000000000 шаблон B
        ('B', 'reta', 'r{reg}'),  # 10:0000110001:{reg}:000000000000000 шаблон B
        ('D', 'retasr', 'r{reg1}, r{reg2}'),  # 10:0000110010:{reg1}:{reg2}:0000000000 шаблон D
        ('D', 'retazr', 'r{reg1}, r{reg2}'),  # 10:0000110011:{reg1}:{reg2}:0000000000 шаблон D
        ('D', 'retapr', 'r{reg1}, r{reg2}'),  # 10:0000110100:{reg1}:{reg2}:0000000000 шаблон D
        ('D', 'retanzr', 'r{reg1}, r{reg2}'),  # 10:0000110101:{reg1}:{reg2}:0000000000 шаблон D
        ('D', 'retager', 'r{reg1}, r{reg2}'),  # 10:0000110110:{reg1}:{reg2}:0000000000 шаблон D
        ('D', 'retaler', 'r{reg1}, r{reg2}'),  # 10:0000110111:{reg1}:{reg2}:0000000000 шаблон D
        ('A', 'reta', '{imm20}'),  # 10:0000111000:{imm20} шаблон A
        ('C', 'retasr', 'r{reg}, {imm15}'),  # 10:0000111001:{reg}:{imm15}  шаблон C
        ('C', 'retazr', 'r{reg}, {imm15}'),  # 10:0000111010:{reg}:{imm15}  шаблон C
        ('C', 'retapr', 'r{reg}, {imm15}'),  # 10:0000111011:{reg}:{imm15}  шаблон C
        ('C', 'retanzr', 'r{reg}, {imm15}'),  # 10:0000111100:{reg}:{imm15}  шаблон C
        ('C', 'retager', 'r{reg}, {imm15}'),  # 10:0000111101:{reg}:{imm15}  шаблон C
        ('C', 'retaler', 'r{reg}, {imm15}'),  # 10:0000111110:{reg}:{imm15}  шаблон C
        ('B', 'trap', 'r{reg}'),  # 10:0000111111:{reg}:000000000000000 шаблон B
        ('A', 'trap', '{imm10}'),  # 10:0001000000:0000000000{imm10} шаблон A
        ('H', 'reti', '')),  # 10:0001000001:00000000000000000000 шаблон H
    # Т=11       
        (('D', 'mov', 'r{reg1}, r{reg2}'),  # 11:0000000000:{reg1}:{reg2}:0000000000 шаблон D
        ('C', 'movu', 'r{reg}, {imm15}'),  # 11:0000000001:{reg}:imm15  шаблон C 
        ('C', 'movs', 'r{reg}, {imm15}'),  # 11:0000000010:{reg}:imm15  шаблон C 
        ('M', 'mov', 'r{reg}, [{mem128}]'),  # 11:0000000011:{reg}:B:IX:SF:00 шаблон M 
        ('M', 'mov8u', 'r{reg}, [{mem8}]'),  # 11:0000000100:{reg}:B:IX:SF:00 шаблон M 
        ('M', 'mov16u', 'r{reg}, [{mem16}]'),  # 11:0000000101:{reg}:B:IX:SF:00 шаблон M 
        ('M', 'mov32u', 'r{reg}, [{mem32}]'),  # 11:0000000110:{reg}:B:IX:SF:00 шаблон M 
        ('M', 'mov64u', 'r{reg}, [{mem64}]'),  # 11:0000000111:{reg}:B:IX:SF:00 шаблон M 
        ('M', 'mov8s', 'r{reg}, [{mem8}]'),  # 11:0000001000:{reg}:B:IX:SF:00 шаблон M 
        ('M', 'mov16u', 'r{reg}, [{mem16}]'),  # 11:0000001001:{reg}:B:IX:SF:00 шаблон M 
        ('M', 'mov32u', 'r{reg}, [{mem32}]'),  # 11:0000001010:{reg}:B:IX:SF:00 шаблон M 
        ('M', 'mov64u', 'r{reg}, [{mem64}]'),  # 11:0000001011:{reg}:B:IX:SF:00 шаблон M 
        ('M', 'mov', '[{mem128}],r{reg}'),  # 11:0000001100:{reg}:B:IX:SF:00 шаблон M 
        ('M', 'mov8', '[{mem8}],r{reg}'),  # 11:0000001101:{reg}:B:IX:SF:00 шаблон M 
        ('M', 'mov16', '[{mem16}],r{reg}'),  # 11:0000001110:{reg}:B:IX:SF:00 шаблон M 
        ('M', 'mov32', '[{mem32}],r{reg}'),  # 11:0000001111:{reg}:B:IX:SF:00 шаблон M 
        ('M', 'mov64', '[{mem64}],r{reg}'),  # 11:0000010000:{reg}:B:IX:SF:00 шаблон M 
        ('D', 'push', 'r{reg1}-r{reg2}'),  # 11:0000010001:r$i$:r$j$:0000000000 шаблон D
        ('D', 'pop', 'r{reg1}-r{reg2}'),  # 11:0000010010:r$i$:r$j$:0000000000 шаблон D
        ('D', 'mov', 'f{reg1}, f{reg2}'),  # 11:0000010011:{reg1}:{reg2}:0000000000 шаблон D
        ('M', 'mov', 'f{reg}, [{mem128}]'),  # 11:0000010100:{reg}:B:IX:SF:00 шаблон M
        ('M', 'mov32f', 'f{reg}, [{mem32}]'),  # 11:0000010101:{reg}:B:IX:SF:00 шаблон M
        ('M', 'mov64f', 'f{reg}, [{mem64}]'),  # 11:0000010110:{reg}:B:IX:SF:00 шаблон M
        ('M', 'mov80f', 'f{reg}, [{mem80}]'),  # 11:0000010111:{reg}:B:IX:SF:00 шаблон M
        ('M', 'mov32f', '[{mem32}], f{reg}'),  # 11:0000011000:{reg}:B:IX:SF:00 шаблон M
        ('M', 'mov64f', '[{mem64}], f{reg}'),  # 11:0000011001:{reg}:B:IX:SF:00 шаблон M
        ('M', 'mov80f', '[{mem64}], f{reg}'),  # 11:0000011010:{reg}:B:IX:SF:00 шаблон M
        ('D', 'push', 'f{reg1}-f{reg2}'),  # 11:0000011011:f$i$:f$j$:0000000000 шаблон D
        ('D', 'pop', 'f{reg1}-f{reg2}'),  # 11:0000011100:f$i$:f$j$:0000000000 шаблон D
        ('B', 'fld1', 'f{reg}'),  # 11:0000011101:{reg}:000000000000000 шаблон B
        ('B', 'fldz', 'f{reg}')))  # 11:0000011110:{reg}:000000000000000 шаблон B
